{
  "category": "Ancient Greece",
  "events": [
    {
      "year": -776,
      "title": "First Olympic Games",
      "description": "The first recorded Olympic Games are held in Olympia, establishing the four-year cycle of the ancient Olympics."
    },
    {
      "year": -750,
      "title": "Greek Colonization Begins",
      "description": "Greeks begin establishing colonies throughout the Mediterranean, spreading Greek culture and trade."
    },
    {
      "year": -750,
      "title": "Homer's Epics Composed",
      "description": "Homer composes the Iliad and Odyssey, foundational works of Western literature that preserve the oral tradition of the Trojan War and its aftermath."
    },
    {
      "year": -650,
      "title": "Rise of Tyrants",
      "description": "Tyrants begin to seize power in various Greek city-states, challenging aristocratic rule."
    },
    {
      "year": -594,
      "title": "Solon's Reforms",
      "description": "Solon institutes major political and economic reforms in Athens, laying the foundation for democracy."
    },
    {
      "year": -508,
      "title": "Cleisthenes Establishes Democracy",
      "description": "Cleisthenes reforms the Athenian constitution, establishing the world's first democratic government."
    },
    {
      "year": -490,
      "title": "Battle of Marathon",
      "description": "Athenian forces defeat the Persians at Marathon, a decisive victory in the First Persian War."
    },
    {
      "year": -480,
      "title": "Battle of Thermopylae",
      "description": "A small Greek force led by King Leonidas of Sparta makes a heroic stand against the Persian army."
    },
    {
      "year": -480,
      "title": "Battle of Salamis",
      "description": "The Greek navy defeats the Persian fleet at Salamis, turning the tide of the Persian Wars."
    },
    {
      "year": -479,
      "title": "Battles of Plataea and Mycale",
      "description": "Greek forces decisively defeat the Persians, ending the Persian invasion of Greece."
    },
    {
      "year": -447,
      "title": "Parthenon Construction Begins",
      "description": "Construction begins on the Parthenon, the magnificent temple dedicated to Athena on the Acropolis, symbolizing the height of Athenian power and artistic achievement."
    },
    {
      "year": -440,
      "title": "Herodotus Writes Histories",
      "description": "Herodotus completes his Histories, earning him the title 'Father of History' for his systematic investigation of the Greco-Persian Wars and the cultures of the ancient world."
    },
    {
      "year": -440,
      "title": "Sophocles' Oedipus Rex",
      "description": "Sophocles writes Oedipus Rex, one of the greatest tragedies of ancient Greek drama, exemplifying the golden age of Athenian theater."
    },
    {
      "year": -430,
      "title": "Euripides' Medea",
      "description": "Euripides writes Medea, showcasing his innovative approach to tragedy and psychological depth in Greek drama."
    },
    {
      "year": -461,
      "title": "First Peloponnesian War Begins",
      "description": "Conflict breaks out between Athens and Sparta, beginning decades of warfare between the two powers."
    },
    {
      "year": -431,
      "title": "Peloponnesian War Begins",
      "description": "The great war between Athens and Sparta begins, lasting 27 years and ending Athenian dominance."
    },
    {
      "year": -430,
      "title": "Plague of Athens",
      "description": "A devastating plague strikes Athens during the Peloponnesian War, killing thousands including Pericles."
    },
    {
      "year": -404,
      "title": "Athens Surrenders",
      "description": "Athens surrenders to Sparta, ending the Peloponnesian War and beginning Spartan hegemony."
    },
    {
      "year": -400,
      "title": "Thucydides' History of the Peloponnesian War",
      "description": "Thucydides completes his History of the Peloponnesian War, establishing rigorous standards for historical writing and political analysis."
    },
    {
      "year": -399,
      "title": "Trial and Death of Socrates",
      "description": "Socrates is tried and executed for corrupting the youth and impiety, becoming a martyr for philosophy."
    },
    {
      "year": -387,
      "title": "Plato Founds the Academy",
      "description": "Plato establishes the Academy in Athens, the first institution of higher learning in the Western world, where he teaches philosophy and mathematics."
    },
    {
      "year": -371,
      "title": "Battle of Leuctra",
      "description": "Thebes defeats Sparta at Leuctra, ending Spartan military dominance and beginning Theban hegemony."
    },
    {
      "year": -359,
      "title": "Philip II Becomes King of Macedon",
      "description": "Philip II becomes king and begins transforming Macedon into a major military power."
    },
    {
      "year": -338,
      "title": "Battle of Chaeronea",
      "description": "Philip II of Macedon defeats the combined forces of Athens and Thebes, establishing Macedonian dominance over Greece."
    },
    {
      "year": -335,
      "title": "Aristotle Founds the Lyceum",
      "description": "Aristotle establishes the Lyceum in Athens, where he teaches and conducts research, creating a comprehensive system of philosophy and science."
    },
    {
      "year": -336,
      "title": "Alexander the Great Becomes King",
      "description": "Alexander succeeds his father Philip II and begins his legendary conquests across Asia."
    },
    {
      "year": -334,
      "title": "Alexander Invades Persia",
      "description": "Alexander begins his invasion of the Persian Empire, winning decisive victories at Granicus and Issus."
    },
    {
      "year": -331,
      "title": "Battle of Gaugamela",
      "description": "Alexander defeats Darius III at Gaugamela, effectively ending the Persian Empire."
    },
    {
      "year": -331,
      "title": "Alexandria Founded",
      "description": "Alexander the Great founds the city of Alexandria in Egypt, which becomes a major center of Hellenistic culture, learning, and commerce."
    },
    {
      "year": -327,
      "title": "Alexander Invades India",
      "description": "Alexander leads his army into India, reaching the furthest extent of his conquests."
    },
    {
      "year": -323,
      "title": "Death of Alexander the Great",
      "description": "Alexander dies in Babylon at age 32, leaving his vast empire to be divided among his generals."
    },
    {
      "year": -322,
      "title": "Death of Aristotle",
      "description": "Aristotle, one of the greatest philosophers in history, dies, leaving behind a vast body of work."
    },
    {
      "year": -301,
      "title": "Battle of Ipsus",
      "description": "The successors of Alexander fight at Ipsus, leading to the final division of his empire."
    },
    {
      "year": -300,
      "title": "Euclid Writes Elements",
      "description": "Euclid compiles Elements, a comprehensive treatise on geometry and mathematics that becomes the standard textbook for over two millennia."
    },
    {
      "year": -280,
      "title": "Library of Alexandria Founded",
      "description": "Ptolemy II establishes the Library of Alexandria, the largest library of the ancient world, becoming a center of scholarship and preserving countless works of literature and science."
    },
    {
      "year": -287,
      "title": "Archimedes Born",
      "description": "Archimedes is born in Syracuse, later becoming one of the greatest mathematicians and inventors of antiquity, known for his work on geometry, mechanics, and hydrostatics."
    },
    {
      "year": -276,
      "title": "Eratosthenes Born",
      "description": "Eratosthenes is born, later becoming the chief librarian of Alexandria and calculating the Earth's circumference with remarkable accuracy."
    },
    {
      "year": -212,
      "title": "Death of Archimedes",
      "description": "Archimedes is killed during the Roman siege of Syracuse, ending the life of one of history's greatest mathematicians and inventors."
    },
    {
      "year": -146,
      "title": "Roman Conquest of Greece",
      "description": "Rome defeats the Achaean League and sacks Corinth, completing the conquest of Greece and ending Greek independence."
    },
    {
      "year": -86,
      "title": "Sulla Sacks Athens",
      "description": "Roman general Sulla sacks Athens during the First Mithridatic War, ending the city's golden age."
    }
  ]
}